# 윈도우즈 드라이브 매핑

드라이브 매핑을 하는 가장 쉬운 방법은 내 PC에 들어가서 네트워크 드라이브 연결을 눌러서 하는 것이다.

하지만 이 방법에는 문제점이 있다. Administrator를 계정을 쓰지 않은 상태에서
이 방법을 통해 네트워크 드라이브를 연결하면 해당 유저 계정으로만 네트워크 드라이브 접근이
가능하기 때문에 서버에서 관리자 권한으로 프로그램을 실행하면 경로를 찾지 못한다고 하면서
실행되지 않는다.

이 문제를 해결하기 위해서는 SYSTEM 계정으로 드라이브 매핑을 해야 한다.

예로 10.0.100.1을 Z: 드라이브에 매핑한다고 가정하였을 때 그 방법은 아래와 같다.

```
윈도우 > 작업 스케쥴러(Task Scheduler) > 기본 작업 만들기

이름: Z Drive Mapping > 컴퓨터 시작시 > 프로그램 시작 > net use Z: \\10.0.100.1\

그 후 작업 스케쥴러 라이브러리에서 Z Drive Mapping항목을 찾아 속성을 연 뒤,

사용자 또는 그룹 변경 > 개체 이름: SYSTEM
```

이렇게 해 놓으면 컴퓨터가 부팅될 때 SYSTEM 계정으로 드라이브 매핑이 되기 때문에
모든 사용자가 해당 드라이브를 이용해 네트워크에 접근할 수 있다.

만일 당장 이 작업이 실행되게 하고 싶으면 해당 항목의 실행 버튼을 누른다.


### 문제점과 해결

#### 부팅 직후 네트워크 접근 불가

원래 네트워크에 접근하기 위해서는 우선 증명이 이루어져야 하는데 (할일: 무슨 종류의 증명인가?)
증명이 이루어지기 까지 시간이 걸리기 때문에 윈도우즈는 각 유저가 캐시된 증명을 통해
드라이브에 접근 할 수 있도록 하는데 실행되는 프로그램은 캐시된 증명을 사용할 수 없다.
따라서 렌더팜 등에는 완전히 네트워크가 붙기 전까지 (데드라인이나 트랙터 같은) 유저 서비스가
실행되서는 안된다.

```
시작 > 그룹 정책 편집

컴퓨터 구성 > 관리 템플릿 > 시스템 > 로그온

컴퓨터 시작 및 로그온 시 네트워크가 초기화될 때까지 항상 대기 > 편집 > 사용
```

